genestealer/everblu-meters-esp8266-improved/src/main.cpp
/*
 * Project: EverBlu Meters ESP8266/ESP32
 * Description: Fetch water/gas usage data from Itron EverBlu Cyble Enhanced RF water meters using the RADIAN protocol on 433 MHz.
 *              Integrated with Home Assistant via MQTT AutoDiscovery.
 * Author: Forked and improved by Genestealer, based on work by Psykokwak and Neutrinus.
 * License: Unknown (refer to the README for details).
 * 
 * Hardware Requirements:
 * - ESP8266/ESP32
 * - CC1101 RF Transceiver
 * 
 * Features:
 * - MQTT integration for Home Assistant
 * - Automatic frequency synthesizer calibration and offset compensation
 * - Wi-Fi diagnostics and OTA updates
 * - Daily scheduled meter readings
 * 
 * For more details, refer to the README file.
 */

#include "private.h"         // Include private configuration (Wi-Fi, MQTT, etc.)
#include "everblu_meters.h" // Include EverBlu meter communication library
#if defined(ESP8266)
#include <ESP8266WiFi.h>    // Wi-Fi library for ESP8266
#include <ESP8266mDNS.h>    // mDNS library for ESP8266
#include <EEPROM.h>         // EEPROM library for ESP8266
#elif defined(ESP32)
#include <WiFi.h>           // Wi-Fi library for ESP32
#include <ESPmDNS.h>        // mDNS library for ESP32
#include <Preferences.h>    // Preferences library for ESP32
#include <esp_task_wdt.h>   // Watchdog timer for ESP32
#endif
#include <Arduino.h>        // Core Arduino library
#include <ArduinoOTA.h>     // OTA update library
#include <EspMQTTClient.h>  // MQTT client library
#include <math.h>           // For floor/ceil during scan alignment

// Cross-platform watchdog feed helper
static inline void FEED_WDT() {
#if defined(ESP8266)
  ESP.wdtFeed();
#elif defined(ESP32)
  esp_task_wdt_reset();
  yield();
#else
  (void)0;
#endif
}

// Define the LED_BUILTIN pin if missing
#ifndef LED_BUILTIN
#define LED_BUILTIN 2 // Change this pin if needed
#endif

// Define the Wi-Fi PHY mode if missing from the private.h file
#ifndef ENABLE_WIFI_PHY_MODE_11G
#define ENABLE_WIFI_PHY_MODE_11G 0  // Set to 1 to enable 11G PHY mode
#endif

// Define the default reading schedule if missing from the private.h file.
// Options: "Monday-Friday", "Monday-Saturday", or "Monday-Sunday"
#ifndef DEFAULT_READING_SCHEDULE
#define DEFAULT_READING_SCHEDULE "Monday-Friday"
#endif

// Optional: configurable daily read time in UTC (hour/minute)
// If not defined in private.h, defaults to 10:00 UTC
#ifndef DEFAULT_READING_HOUR_UTC
#define DEFAULT_READING_HOUR_UTC 10
#endif
#ifndef DEFAULT_READING_MINUTE_UTC
#define DEFAULT_READING_MINUTE_UTC 0
#endif

// Auto-align scheduled reading time to the meter's wake window (time_start/time_end)
// 1 = enabled (default), 0 = disabled
#ifndef AUTO_ALIGN_READING_TIME
#define AUTO_ALIGN_READING_TIME 1
#endif

// Alignment strategy: 0 = use time_start, 1 = use midpoint of [time_start, time_end]
#ifndef AUTO_ALIGN_USE_MIDPOINT
#define AUTO_ALIGN_USE_MIDPOINT 1
#endif

// Resolved reading time (UTC) which may be updated dynamically after a successful read
static int g_readHourUtc = DEFAULT_READING_HOUR_UTC;
static int g_readMinuteUtc = DEFAULT_READING_MINUTE_UTC;

// Define a default meter frequency if missing from private.h.
// RADIAN protocol nominal center frequency for EverBlu is 433.82 MHz.
#ifndef FREQUENCY
#define FREQUENCY 433.82
#define FREQUENCY_DEFINED_DEFAULT 1
#else
#define FREQUENCY_DEFINED_DEFAULT 0
#endif

unsigned long lastWifiUpdate = 0;

// Read success/failure metrics
unsigned long totalReadAttempts = 0;
unsigned long successfulReads = 0;
unsigned long failedReads = 0;
const char* lastErrorMessage = "None";

// Frequency offset storage
#define EEPROM_SIZE 64
#define FREQ_OFFSET_ADDR 0
#define FREQ_OFFSET_MAGIC 0xABCD // Magic number to verify valid data
float storedFrequencyOffset = 0.0;
bool autoScanEnabled = true;       // Enable automatic scan on first boot if no offset found
int successfulReadsBeforeAdapt = 0; // Track successful reads for adaptive tuning
float cumulativeFreqError = 0.0;   // Accumulate FREQEST readings for adaptive adjustment
const int ADAPT_THRESHOLD = 10;    // Adapt frequency after N successful reads

#if defined(ESP32)
Preferences preferences;
#endif

// ============================================================================
// Frequency Management API
// ============================================================================

/**
 * @brief Save frequency offset to persistent storage
 * 
 * Stores the frequency offset value to EEPROM (ESP8266) or Preferences (ESP32)
 * with a magic number for validation. This offset is applied on next boot.
 * 
 * @param offset Frequency offset in MHz to be added to base frequency
 */
void saveFrequencyOffset(float offset);

/**
 * @brief Load frequency offset from persistent storage
 * 
 * Retrieves previously saved frequency offset from EEPROM (ESP8266) or 
 * Preferences (ESP32). Validates data integrity using magic number.
 * 
 * @return Frequency offset in MHz, or 0.0 if no valid data found
 */
float loadFrequencyOffset();

/**
 * @brief Perform narrow-range frequency scan
 * 
 * Scans a narrow frequency range (±0.003 MHz around current frequency)
 * with fine step resolution (0.0005 MHz) to find optimal meter frequency.
 * Used for fine-tuning when close to correct frequency.
 * 
 * Updates global frequency offset if better frequency is found.
 */
void performFrequencyScan();

/**
 * @brief Perform wide-range initial frequency scan
 * 
 * Performs comprehensive frequency scan over wider range (±0.030 MHz)
 * with coarser step resolution (0.001 MHz). Used on first boot or when
 * no stored offset exists. More time-consuming but covers larger uncertainty.
 * 
 * Saves discovered offset to persistent storage on success.
 */
void performWideInitialScan();

/**
 * @brief Adaptive frequency tracking using FREQEST
 * 
 * Accumulates frequency offset estimates from successful meter reads and
 * gradually adjusts radio frequency to track meter drift. Applies adjustment
 * after ADAPT_THRESHOLD successful reads to ensure statistical reliability.
 * 
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest);

// ============================================================================
// State Machine Forward Declarations
// ============================================================================

/**
 * @enum SystemState
 * @brief State machine states for meter reading operation
 */
enum SystemState {
  STATE_INIT,
  STATE_IDLE,
  STATE_CHECK_SCHEDULE,
  STATE_COOLDOWN_WAIT,
  STATE_START_READING,
  STATE_READING_IN_PROGRESS,
  STATE_RETRY_WAIT,
  STATE_PUBLISH_SUCCESS,
  STATE_PUBLISH_FAILURE
};

/**
 * @brief Transition to new state
 * @param newState State to transition to
 */
void enterState(SystemState newState);

/**
 * @brief Check if current time matches scheduled reading time
 * @return true if current time is exactly the scheduled reading time
 */
bool isScheduledReadingTime();

/**
 * @brief Check if system is in cooldown period
 * @return true if currently in cooldown period
 */
bool isInCooldownPeriod();

/**
 * @brief Execute state machine logic
 */
void handleStateMachine();

// Secrets pulled from private.h file
EspMQTTClient mqtt(
    secret_wifi_ssid,     // Your Wifi SSID
    secret_wifi_password, // Your WiFi key
    secret_mqtt_server,   // MQTT Broker server ip
    secret_mqtt_username, // MQTT Username Can be omitted if not needed
    secret_mqtt_password, // MQTT Password Can be omitted if not needed
    secret_clientName,    // MQTT Client name that uniquely identify your device
    1883                  // MQTT Broker server port
);

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

int _retry = 0;
const int MAX_RETRIES = 3; // Maximum number of retry attempts
unsigned long lastFailedAttempt = 0; // Timestamp of last failed attempt
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds

