genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Get WiFi details (use String for network functions that return String)
  char wifiIP[16];
  snprintf(wifiIP, sizeof(wifiIP), "%s", WiFi.localIP().toString().c_str());
  
  int wifiRSSI = WiFi.RSSI();
  int wifiSignalPercentage = calculateWiFiSignalStrengthPercentage(wifiRSSI);
  
  char macAddress[18];
  snprintf(macAddress, sizeof(macAddress), "%s", WiFi.macAddress().c_str());
  
  char wifiSSID[33];
  snprintf(wifiSSID, sizeof(wifiSSID), "%s", WiFi.SSID().c_str());
  
  char wifiBSSID[18];
  snprintf(wifiBSSID, sizeof(wifiBSSID), "%s", WiFi.BSSIDstr().c_str());
  
  const char* status = (WiFi.status() == WL_CONNECTED) ? "online" : "offline";

  // Uptime calculation
  unsigned long uptimeMillis = millis();
  time_t uptimeSeconds = uptimeMillis / 1000;
  time_t now = time(nullptr);
  time_t uptimeTimestamp = now - uptimeSeconds;
  char uptimeISO[32];
  strftime(uptimeISO, sizeof(uptimeISO), "%FT%TZ", gmtime(&uptimeTimestamp));

  // Publish diagnostic sensors (using char buffers instead of String)
  char valueBuffer[16];
  
  mqtt.publish("everblu/cyble/wifi_ip", wifiIP, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiRSSI);
  mqtt.publish("everblu/cyble/wifi_rssi", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiSignalPercentage);
  mqtt.publish("everblu/cyble/wifi_signal_percentage", valueBuffer, true);
  delay(5);
  
  mqtt.publish("everblu/cyble/mac_address", macAddress, true);
  delay(5);
  mqtt.publish("everblu/cyble/ssid", wifiSSID, true);
  delay(5);
  mqtt.publish("everblu/cyble/bssid", wifiBSSID, true);
  delay(5);
  mqtt.publish("everblu/cyble/status", status, true);
  delay(5);
  mqtt.publish("everblu/cyble/uptime", uptimeISO, true);
  delay(5);

  Serial.println("> Wi-Fi details published");
}

/**
 * @brief Publish meter configuration to MQTT
 * 
 * Publishes static meter configuration including:
 * - Meter year and serial number
 * - Reading schedule (days of week)
 * - Reading time (UTC, HH:MM format)
 * 
 * Called once during connection establishment.
 */
void publishMeterSettings() {
  Serial.println("> Publish meter settings");

  // Publish Meter Year, Serial (using char buffers instead of String)
  char valueBuffer[16];
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", METER_YEAR);
  mqtt.publish("everblu/cyble/water_meter_year", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%u", METER_SERIAL);
  mqtt.publish("everblu/cyble/water_meter_serial", valueBuffer, true);
  delay(5);

  // Publish Reading Schedule
  mqtt.publish("everblu/cyble/reading_schedule", readingSchedule, true);
  delay(5);

  // Publish Reading Time (UTC) as HH:MM text (resolved time that may be auto-aligned)
  char readingTimeFormatted[6];
  snprintf(readingTimeFormatted, sizeof(readingTimeFormatted), "%02d:%02d", (int)g_readHourUtc, (int)g_readMinuteUtc);
  mqtt.publish("everblu/cyble/reading_time", readingTimeFormatted, true);
  delay(5);

  Serial.println("> Meter settings published");
}

/**
 * @brief MQTT connection established callback
 * 
 * Called when MQTT connection is successfully established. Performs:
 * 1. NTP time synchronization
 * 2. Arduino OTA initialization
 * 3. Home Assistant MQTT Discovery publishing
 * 4. MQTT topic subscriptions (trigger, frequency_scan)
 * 5. Initial WiFi and meter settings publishing
 * 
 * Also sets up MQTT callbacks for manual trigger and frequency scan commands.
 */
void onConnectionEstablished()
{
  Serial.println("Connected to MQTT Broker :)");

  Serial.println("> Configure time from NTP server. Please wait...");
  // Note, my VLAN has no WAN/internet, so I am useing Home Assistant Community Add-on: chrony to proxy the time
  configTzTime("UTC0", secret_local_timeclock_server);

  delay(5000); // Give it a moment for the time to sync the print out the time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);
  
  Serial.println("> Configure Arduino OTA flash.");
  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    }
    else { // U_FS
      type = "filesystem";
    }
    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd updating.");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("%u%%\r\n", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    }
    else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    }
    else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    }
    else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    }
    else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    }
  });
  ArduinoOTA.setHostname("EVERBLUREADER");
  ArduinoOTA.begin();
  Serial.println("> Ready");
  Serial.print("> IP address: ");
  Serial.println(WiFi.localIP());

  mqtt.subscribe("everblu/cyble/trigger", [](const String& message) {
    // Input validation: only accept whitelisted commands
    if (message != "update" && message != "read") {
      Serial.printf("WARN: Invalid trigger command '%s' (expected 'update' or 'read')\n", message.c_str());
      mqtt.publish("everblu/cyble/status_message", "Invalid trigger command", true);
      return;
    }
    
    // Check if we're in cooldown period
    if (lastFailedAttempt > 0 && (millis() - lastFailedAttempt) < RETRY_COOLDOWN) {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      Serial.printf("Cannot trigger update: Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);
      
      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      mqtt.publish("everblu/cyble/status_message", cooldownMsg, true);
      return;
    }

