genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Debug state transitions
  const char* stateNames[] = {
    "INIT", "IDLE", "CHECK_SCHEDULE", "COOLDOWN_WAIT",
    "START_READING", "READING_IN_PROGRESS", "RETRY_WAIT",
    "PUBLISH_SUCCESS", "PUBLISH_FAILURE"
  };
  Serial.printf("[STATE] Entering: %s\n", stateNames[newState]);
}

/**
 * @brief Check if current time matches scheduled reading time
 * 
 * Evaluates whether current time (UTC) matches the configured reading
 * schedule (day of week and exact hour:minute:00).
 * 
 * @return true if current time is exactly the scheduled reading time
 */
bool isScheduledReadingTime() {
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  
  // Check if today is a valid reading day and it's the exact scheduled time
  return isReadingDay(ptm) && 
         ptm->tm_hour == g_readHourUtc && 
         ptm->tm_min == g_readMinuteUtc && 
         ptm->tm_sec == 0;
}

/**
 * @brief Check if system is in cooldown period
 * 
 * After max retries are exhausted, system enters 1-hour cooldown period
 * to avoid hammering the meter. This function checks if cooldown is active.
 * 
 * @return true if currently in cooldown period
 */
bool isInCooldownPeriod() {
  return lastFailedAttempt > 0 && 
         (millis() - lastFailedAttempt) < RETRY_COOLDOWN;
}

/**
 * @brief Execute state machine logic
 * 
 * Main state machine handler called from loop(). Implements non-blocking
 * meter reading with:
 * - Schedule checking every 500ms
 * - Retry logic with exponential backoff
 * - 1-hour cooldown after max retries
 * - MQTT status publishing
 * - Adaptive frequency tracking
 * 
 * Must be called frequently from loop() for proper operation.
 */
void handleStateMachine() {
  unsigned long now = millis();
  
  switch (currentState) {
    case STATE_INIT:
      // After setup completes, transition to idle
      Serial.println("[STATE] Initialization complete, entering IDLE");
      nextScheduleCheck = now;
      enterState(STATE_IDLE);
      break;
      
    case STATE_IDLE:
      // Check schedule every 500ms
      if (now >= nextScheduleCheck) {
        nextScheduleCheck = now + 500;
        enterState(STATE_CHECK_SCHEDULE);
      }
      break;
      
    case STATE_CHECK_SCHEDULE:
      if (isScheduledReadingTime()) {
        if (isInCooldownPeriod()) {
          enterState(STATE_COOLDOWN_WAIT);
        } else {
          // Reset retry counter and start reading
          _retry = 0;
          lastFailedAttempt = 0;
          Serial.println("It is time to update data from meter :)");
          enterState(STATE_START_READING);
        }
      } else {
        // Not time yet, return to idle
        enterState(STATE_IDLE);
      }
      break;
      
    case STATE_COOLDOWN_WAIT:
      if (isInCooldownPeriod()) {
        unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
        if (now - stateEntryTime >= 5000) { // Log every 5 seconds
          Serial.printf("Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);
          char cooldownMsg[64];
          snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
          mqtt.publish("everblu/cyble/status_message", cooldownMsg, true);
          stateEntryTime = now; // Reset for next log
        }
        // Stay in this state until cooldown ends
        enterState(STATE_CHECK_SCHEDULE); // Recheck next cycle
      } else {
        // Cooldown expired, can proceed
        lastFailedAttempt = 0;
        _retry = 0;
        enterState(STATE_START_READING);
      }
      break;
      
    case STATE_START_READING:
      Serial.printf("Updating data from meter...\n");
      Serial.printf("Retry count : %d\n", _retry);
      Serial.printf("Reading schedule : %s\n", readingSchedule);
      
      totalReadAttempts++;
      digitalWrite(LED_BUILTIN, LOW); // Turn on LED
      mqtt.publish("everblu/cyble/active_reading", "true", true);
      mqtt.publish("everblu/cyble/cc1101_state", "Reading", true);
      
      readingInProgress = true;
      enterState(STATE_READING_IN_PROGRESS);
      break;
      
    case STATE_READING_IN_PROGRESS:
      // Perform the actual meter read (this is blocking, but we track it)
      if (readingInProgress) {
        pendingMeterData = get_meter_data();
        readingInProgress = false;
        
        // Get current time
        time_t tnow = time(nullptr);
        struct tm *ptm = gmtime(&tnow);
        Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", 
                      ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, 
                      ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);
        
        // Check if we got valid data
        if (pendingMeterData.reads_counter == 0 || pendingMeterData.liters == 0) {
          Serial.printf("Unable to retrieve data from meter (attempt %d/%d)\n", _retry + 1, MAX_RETRIES);
          enterState(STATE_PUBLISH_FAILURE);
        } else {
          enterState(STATE_PUBLISH_SUCCESS);
        }
      }
      break;
      
    case STATE_RETRY_WAIT:
      // Wait for retry delay
      if (now >= retryDelayUntil) {
        Serial.printf("Retry delay complete, attempting read again\n");
        enterState(STATE_START_READING);
      }
      break;
      
    case STATE_PUBLISH_FAILURE:
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      mqtt.publish("everblu/cyble/active_reading", "false", true);
      mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
      
      if (_retry < MAX_RETRIES - 1) {
        // Schedule retry
        _retry++;
        static char errorMsg[64];
        snprintf(errorMsg, sizeof(errorMsg), "Retry %d/%d - No data received", _retry, MAX_RETRIES);
        lastErrorMessage = errorMsg;
        Serial.printf("Scheduling retry in 10 seconds... (next attempt %d/%d)\n", _retry + 1, MAX_RETRIES);
        mqtt.publish("everblu/cyble/last_error", lastErrorMessage, true);
        
        retryDelayUntil = now + 10000; // 10 second delay
        enterState(STATE_RETRY_WAIT);
      } else {
        // Max retries reached
        lastFailedAttempt = now;
        failedReads++;
        lastErrorMessage = "Max retries reached - cooling down";
        
        Serial.printf("Max retries reached. Entering %lu second cooldown period.\n", RETRY_COOLDOWN / 1000);
        mqtt.publish("everblu/cyble/last_error", lastErrorMessage, true);
        mqtt.publish("everblu/cyble/status_message", "Max retries - cooldown active", true);
        
        char buffer[16];
        snprintf(buffer, sizeof(buffer), "%lu", failedReads);
        mqtt.publish("everblu/cyble/failed_reads", buffer, true);
        
        snprintf(buffer, sizeof(buffer), "%lu", totalReadAttempts);
        mqtt.publish("everblu/cyble/total_attempts", buffer, true);
        
        // Return to idle after cooldown
        enterState(STATE_IDLE);
      }
      break;
      
    case STATE_PUBLISH_SUCCESS:
      // Publish all meter data
      {
        char valueBuffer[32];
        time_t tnow = time(nullptr);
        char iso8601[128];
        strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));
        
        // Format time_start and time_end
        char timeStartFormatted[6], timeEndFormatted[6];
        snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", pendingMeterData.time_start);
        snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", pendingMeterData.time_end);
        
